{
  "home.subTitle": "Transformo líneas de código en experiencias web únicas.",

  "about.title": "sobre MI",
  "about.p1": "Graduada en <span>Ingeniería de Sistemas</span>, en busca de emocionantes desafíos en el campo del desarrollo Full Stack, con un enfoque particular en el <span>Front-End</span>. También poseo habilidades sólidas en el <span>Back End</span>, lo que me permite comprender y abordar proyectos de manera integral, desde el diseño de la interfaz de usuario hasta la gestión de datos en el backend.",
  "about.p2": "Mi objetivo es contribuir al desarrollo de soluciones tecnológicas innovadoras y eficientes, aprovechando mi educación y pasión por el desarrollo para tener un impacto en el mundo digital.",
  "about.subtitle1": "Tecnologías",
  "about.subtitle2": "Educación & Experiencia",
  "timeLine": [
    {
      "img": "/static/svg/graduateIcon.svg",
      "alt": "graduateIcon",
      "year": "2023",
      "title": "Full Stack Developer | soyHenry Bootcamp",
      "description": "Participé en un bootcamp de desarrollo web donde adquirí habilidades para convertirme en un desarrollador Full Stack. Durante el programa, completé cuatro proyectos integrales que abarcaron tanto el desarrollo front-end como el back-end. Además, gané valiosa experiencia colaborando en proyectos grupales utilizando la metodología Scrum para la gestión de equipos ágiles. También tuve la oportunidad de destacarme al ganar varios concursos relacionados con el desarrollo web."
    },
    {
      "img": "/static/svg/workIcon.svg",
      "alt": "workIcon",
      "year": "2022",
      "title": "Development Analyst | Incalpaca",
      "description": "Desarrollé programas en Genexus según los requisitos empresariales, utilizando MySQL para consultas diarias a la base de datos y la integración de resultados en soluciones eficaces. Mejoré funcionalidades en programas existentes para satisfacer las demandas comerciales y optimizar el rendimiento en producción. Diseñé pruebas exhaustivas para validar el correcto funcionamiento de programas nuevos y existentes en producción, garantizando su eficacia"
    },
    {
      "img": "/static/svg/workIcon.svg",
      "alt": "workIcon",
      "year": "2021",
      "title": "Analyst Programmer | De Larrobla & Asociados (DL&A)",
      "description": "Desarrollé programas utilizando GeneXus, automatizando el intercambio de datos a través de SOAPUI, mejorando funcionalidades y rendimiento en programas existentes, y empleando AS400 para consultas a bases de datos. Además, proporcioné documentación detallada de procesos y mejoras en un entorno de desarrollo de software para entidades financieras, siguiendo la metodología Scrum y colaborando con equipos internacionales de diferentes países."
    },
    {
      "img": "/static/svg/graduateIcon.svg",
      "alt": "graduateIcon",
      "year": "2017 - 2021",
      "title": "Bachiller en Ingenieria de sistemas | Universidad Catolica de Santa Maria",
      "description": "Obtuve mi formación académica en la Universidad Católica de Santa María, donde me gradué en Ingeniería de Sistemas."
    }
  ],

  "projects.title": "proyectos",

  "nav.home": "Inicio",
  "nav.about": "Perfil",
  "nav.projects": "Proyectos",
  "nav.contact": "Contacto",

  "contact.title": "Contacto",
  "contact.name": "Nombre",
  "contact.phone": "Celular",
  "contact.email": "Email",
  "contact.message": "Mensaje",
  "contact.submit": "Enviar"
}
